/** @format */

import Image from 'next/image'
import { UL, LI } from '../../Components/List'
import { PageTitle } from '../../Components/common'
import indoorImage from '../../assets/images/indoor.png'

export default function Page() {
  return (
    <>
      <PageTitle title='انواع توپولوژی' />

      <UL title='توپولوژی Bus'>
        <LI title='امنیت'>
          در این حالت ارسال داده از یک سیستم به یک سیستم خاص وجود ندارد. یعنی اگر سیستم شماره یک داده ای را ارسال کند
          تمام سیستم های موجود در شبکه به آن داده دسترسی خواهند داشت.
        </LI>
        <LI title='ترافیک شبکه'>بدلیل ارسال داده به تمامی سیستم ها شاهد افزایش ترافیک در شبکه خواهیم بود.</LI>
        <LI title='سرعت شبکه'>بدلیل ارسال داده به تمامی سیستم ها شاهد کاهش سرعت در شبکه خواهیم بود.</LI>
        <LI title='Collision'>
          به دلیل تک هسته ای بودن کابل کواکسیال اگر همزمان دو سیستم داده ارسال کنند این داده ها به هم برخورد می کند و از
          بین می روند. در نتیجه هنگام ارسال داده از یک سیستم بقیه سیستم ها نباید داده ای را ارسال کنند. به وسیله Access
          Method CSMA/CD این مورد کنترل می شود.
        </LI>
        <LI title='Terminator'>
          در ابتدا و انتهای کابل کواکسیال که سیستمی متصل نیست نصب می شود که باعث می شود داده از آن مسیر خارج شود و به
          زمین منتقل شود. در غیر این صورت داده انقدر در شبکه می چرخد تا از بین برود و این خود باعث کاهش بیشتر سرعت شبکه
          می شود.
        </LI>
      </UL>

      <UL title='ارتباط Indoor'>
        <LI title='Thinnet'>
          یک مدل کابل کواکسیال که برای شبکه ی یک ساختمان استفاده می شود که تا حدود ۲۰۰ متر قابلیت شبکه کردن سیستم ها در
          طبقات مختلف یک ساختمان را دارد.
        </LI>
        <LI title='Signet'>
          یک نوع کابل کواکسیال قوی تر برای ارتباط شبکه بین دو ساختمان تا فاصله ی ۵۰۰ متر استفاده می شود. در صورتی که
          فاصله از ۵۰۰ متر بیشتر شود از دستگاهی به نام Repeater در مسیر Signet استفاده می شود.
        </LI>
        <LI title='Repeater'>
          وظیفه ی Repeater تقویت سیگنال است که داده بتواند مسیر بیشتری از ۵۰۰ متر را در Signet طی کند.
        </LI>
        <LI title='Troubleshooting'>
          برای پیدا کردن علت قطعی شبکه شبکه را به قسمت های کوچک تر خورد می کنند. مثلا اگر ۱۰۰ سیستم درون شبکه وجود دارد
          ابتدا آن ها را به پارت های ۱۰ تایی تقسیم می کنند تا پارتی که شبکه در آن برقرار نیست را پیدا کنند. سپس با پیدا
          کردن پارت معیوب اقدام به رفع قطعی در آن بخش می کنند.
        </LI>
      </UL>
      <div className='flex justify-center'>
        <Image src={indoorImage} width={700} height={500} alt='indoor' className='mt-2' />
      </div>
    </>
  )
}
