/** @format */

import Image from 'next/image'
import { UL, LI } from '../Components/List'
import { PageTitle, TextNote } from '../Components/common'
import osiImage from '../assets/images/osi.png'
import tcpImage from '../assets/images/tcp.png'

export default function Page() {
  return (
    <>
      <PageTitle title='OSI Model' />

      <UL title='لایه های مدل OSI'>
        <LI title='Application'>این بخش همان User Interface برنامه می باشد که کاربر با آن تعامل دارد.</LI>
        <LI title='Presentation'>
          این لایه وظیفه ی رمزنگاری و فشرده سازی و فرمت بندی داده ها را دارد. فرمت بندی داده ها بطوریکه برای لایه های
          دیگر قابل فهم باشد.
        </LI>
        <LI title='Session'>
          لایه سشن در مدل OSI وظیفه برقراری، مدیریت و پایان دادن به نشست‌های ارتباطی بین دو سیستم را بر عهده دارد و با
          کنترل نحوه تبادل داده‌ها، اطمینان می‌دهد که ارتباط به صورت منظم و قابل بازیابی انجام شود.
        </LI>
        <LI title='Transport'>
          لایه ترنسپورت در مدل OSI مسئول انتقال داده‌ها به صورت قابل اطمینان و بدون خطا بین دو دستگاه است. این لایه
          وظایفی مانند تقسیم داده‌ها به بسته‌های کوچک‌تر، کنترل جریان داده‌ها، تشخیص و تصحیح خطاها و مدیریت ارتباطات را
          بر عهده دارد تا اطمینان حاصل شود که داده‌ها به ترتیب درست و بدون از دست رفتن به مقصد می‌رسند.
        </LI>
        <LI title='Network'>
          لایه نتورک (Network Layer) در مدل OSI وظیفه مسیریابی و هدایت بسته‌های داده از مبدا به مقصد در شبکه‌های مختلف
          را بر عهده دارد. این لایه آدرس‌دهی منطقی (مثل آدرس‌های IP)، انتخاب بهترین مسیر (مسیریابی)، و مدیریت ترافیک
          شبکه را انجام می‌دهد تا داده‌ها به درستی و بهینه به مقصد برسند. همچنین لایه نتورک مسئول تفکیک بسته‌ها و انتقال
          آن‌ها بین شبکه‌های مختلف است.
        </LI>
        <LI title='Data Link'>
          لایه دیتا لینک در مدل OSI مسئول انتقال داده‌ها بین دو دستگاه متصل در یک شبکه محلی است. این لایه داده‌ها را به
          فریم تقسیم می‌کند، آدرس مک دستگاه‌ها را اضافه می‌کند تا مقصد و مبدا مشخص باشد، خطاهای انتقال را تشخیص و اصلاح
          می‌کند و کنترل دسترسی به رسانه را مدیریت می‌کند تا انتقال داده‌ها بدون تداخل و به‌درستی انجام شود.
        </LI>
        <LI title='Physical'>
          لایه فیزیکال مسئول ارسال و دریافت سیگنال‌های دیجیتال روی کابل یا امواج است و مشخص می‌کند چطور داده‌ها به شکل
          فیزیکی منتقل شوند. در دنیای واقعی اداره پست ( که وظیفه ی حمل فیزیکی بسته که شامل آدرس و داده های بسته را بر
          عهده دارد ) معادل لایه ی Physical است.
        </LI>
      </UL>
      <div className='flex justify-center'>
        <TextNote important size='text-md'>
          تمامی مراحل فوق در مقصد ( محلی که داده دریافت می شود ) بصورت برعکس از پایین به بالا طی می شود تا به دست کاربر
          در لایه Application برسد.
        </TextNote>
      </div>

      <div className='flex justify-center'>
        <TextNote important size='text-md'>
          مدل OSI یک چارچوب مفهومی و استاندارد نظری است که عمدتاً برای آموزش، تحلیل و طراحی پروتکل‌های شبکه به کار
          می‌رود. در مقابل، مدل TCP/IP یک مدل عملی و کاربردی است که پروتکل‌های اصلی اینترنت بر اساس آن توسعه یافته‌اند و
          به طور گسترده در شبکه‌های واقعی مورد استفاده قرار می‌گیرد.
        </TextNote>
      </div>
      <div className='flex justify-between'>
        <Image src={osiImage} width={800} height={600} alt='osi' className='mt-2' />
        <Image src={tcpImage} width={800} height={600} alt='tcp' className='mt-2' />
      </div>
    </>
  )
}
