/** @format */

import { PageTitle } from '../../Components/common'
import { UL, LI } from '../../Components/List'

export default function Page() {
  return (
    <>
      <PageTitle title='اطلاعات' />

      <UL title='Information'>
        <LI title='Protocol'>
          پروتکل شبکه مجموعه‌ای از قوانین، استانداردها و رویه‌ها است که نحوه‌ی برقراری، مدیریت و پایان ارتباط بین
          دستگاه‌های مختلف در یک شبکه را مشخص می‌کند. این قوانین شامل مواردی مانند ساختار داده‌ها، زمان‌بندی تبادل
          پیام‌ها، روش‌های تشخیص و تصحیح خطا، و نحوه‌ی آدرس‌دهی می‌باشند.
        </LI>
        <LI title='ICMP یا Internet Control Message Protocol'>
          پICMP یک پروتکل پشتیبانی در لایه‌ی سوم مدل OSI (لایه شبکه) است که به کمک آن روترها و میزبان‌ها می‌توانند خطاها
          را گزارش کنند، اطلاعات وضعیت ارسال کنند یا بررسی ارتباط را انجام دهند. دستور ping و tracert از پروتکل ICMP
          استفاده می کند.
        </LI>
        <LI title='tracert (windows) / traceroute (linux)'>
          دستور tracert در ویندوز و traceroute در لینوکس وظیفه بررسی مسیر ارتباط بین دو نقطه از شبکه را به عهده دارد.
          <br />
          مثلا:
          <code>traceroute asiatech.ir</code>
          <br />
          traceroute to asiatech.ir (185.98.112.170), 30 hops max, 60 byte packets
          <br />
          1 172.17.110.254 (172.17.110.254) 0.299 ms 0.245 ms 0.250 ms
          <br />
          2 192.168.100.1 (192.168.100.1) 0.400 ms 0.684 ms 0.753 ms
          <br />
          3 172.24.90.185 (172.24.90.185) 11.547 ms 11.659 ms 7.525 ms
          <br />
          4 172.24.29.233 (172.24.29.233) 7.614 ms 11.510 ms 11.505 ms
          <br />
          5 172.24.41.1 (172.24.41.1) 15.576 ms 19.575 ms 19.546 ms
          <br />
          6 * * *
          <br />
          7 172.24.124.1 (172.24.124.1) 11.541 ms 15.629 ms 19.607 ms
          <br />
          7 * * *
          <br />
          8 172.19.17.154 (172.19.17.154) 11.859 ms 11.852 ms 11.417 ms
          <br />
          بخش هایی به با ستاره نمایش داده شده به این معناست که ارسال اطلاعات از روتر امکان پذیر نبوده است. مثلا روتر
          طوری تنظیم شده است که به درخواست های ICMP پاسخ نمی دهد.
          <br />
          در لیست بالا IP ها نشان دهنده ی IP روتر هایی می باشد که درخواست را به مقصد هدایت می کنند.
        </LI>
      </UL>
    </>
  )
}
