/** @format */

import { Card } from '@/app/Components/common'
import { SimpleLI, SimpleUL } from '@/app/Components/List'

export default function Stack() {
  return (
    <Card title='Stack'>
      <p>استک یک ناحیه حافظه‌ی سریع و ساختارمند (LIFO) هست.</p>
      <p>
        LIFO مخفف Last IN, First Out می باشد. به این معنی که آخرین چیزی که به استک وارد می شود، اولین چیزی است که از آن
        خارج می شود.
      </p>
      <SimpleUL title='مثال'>
        <SimpleLI>آخرین تابعی که اجرا می‌شود → اول از همه تمام می‌شود</SimpleLI>
        <SimpleLI>آخرین متغیری که وارد استک می‌شود → اول خارج می‌شود</SimpleLI>
      </SimpleUL>

      <SimpleUL title='ویژگی ها'>
        <SimpleLI title='خیلی سریع'>-</SimpleLI>
        <SimpleLI title='مدیریت خودکار (با ورود/خروج از scope)'>
          <p>Stack بر اساس ساختار LIFO و قوانین زبان برنامه‌نویسی کار می‌کند.</p>
          <p>وقتی وارد یک بلاک یا تابع می شوید → یک «stack frame» ساخته می شود.</p>
          <p>
            Stack frame یعنی یک «بخش جدا از حافظه استک» که برای هر بار اجرای یک تابع ساخته می‌شود و معمولا پارامترهای
            تابع، متغیر های محلی و آدرس بازگشت در آن قرار دارد.
          </p>
          <p>وقتی از آن تابع خارج می شویم → همان لحظه خودکار حذف می شود.</p>
          <p>نتیجه: نیازی به free یا delete ندارید چون خود سیستم این کار را با پایان scope انجام می دهد.</p>
        </SimpleLI>
        <SimpleLI title='اندازه محدود'>
          <p>Stack یک ناحیه حافظه‌ی از پیش‌تخصیص داده‌شده در RAM است.</p>
          <p>برای سرعت بالا طراحی شده، نه برای ذخیره‌سازی بزرگ.</p>
          <p>اگر خیلی از استک استفاده کنیم overflow رخ می دهد.</p>
        </SimpleLI>
        <SimpleLI title='برای داده‌های کوتاه‌عمر'>
          <p>
            چون با خروج از scope فوراً پاک می‌شود، فقط داده‌هایی منطقی‌اند که عمرشان کوتاه است (مثل متغیرهای محلی تابع).
          </p>
          <p>
            داده‌های طولانی‌عمر (مثلاً objectهایی که باید بعد از تابع زنده بمانند) نمی‌توانند روی stack بمانند و می‌روند
            روی heap.
          </p>
        </SimpleLI>
        <SimpleLI title='مواردی که در آن ذخیره می شود'>
          <SimpleUL>
            <SimpleLI>متغیر های محلی</SimpleLI>
            <SimpleLI title='آدرس بازگشتی تابع'>
              <p>آدرسی در برنامه که CPU باید بعد از تمام شدن تابع، اجرای برنامه را از همان‌جا ادامه بدهد.</p>
              <p>
                دلیل نگهداری آدرس بازگشتی تابع این است که وقتی یک تابع صدا زده می شود، برنامه می پرد به داخل تابع، و پس
                از اتمام دستورات تابع، باید برگردد به همان نقطه قبلی. این کار بدون داشتن آدرس بازگشتی تابع ممکن نیست.
              </p>
            </SimpleLI>
            <SimpleLI>پارامتر های تابع</SimpleLI>
          </SimpleUL>
        </SimpleLI>
      </SimpleUL>
    </Card>
  )
}
