/** @format */

import { Bold, Card, Code } from '@/app/Components/common'

export default function Encapsulation() {
  return (
    <Card title='Encapsulation'>
      <p>کپسوله سازی به معنای محافظت از بیزینس رول ها در برابر تغییرات بیرونی است.</p>
      <p>
        در مثال زیر مقدار <code>commentsCount</code> پس از عبور از قوانین متد <code>removeComments</code> مقدار دهی می
        شود. یعنی کاربر نمی تواند بصورت مستقیم مقدار <code>commentsCount</code> را تغییر دهد. اهمیت این موضوع زمانی مشخص
        می شود که مقدار دهی به <code>state</code> ها فقط و فقط تحت شرایط خاصی (بیزینس رول ها) اتفاق می افتد، نه عوامل
        بیرونی ای شبیه به مقدار دهی دلخواه از خارج از کلاس. در اینجا کاهش تعداد کامنت،
        <Bold>نتیجه ی یک رفتار (حذف کامنت)</Bold> است، نه مقدار دهی صریح توسط عوامل بیرونی، پس مقدار دهی دستی برای آن
        مجاز نیست.
      </p>
      <Code>encapsulation.php</Code>
      <p>
        یک مثال در دنیای واقعی می تواند به این صورت باشد که فرضا برای چربی سوزی ما باید <Bold>رفتار هوازی</Bold> انجام
        دهیم تا چربی ها کاهش یابد و نمی توانیم مستقیما به چربی دسترسی داشته باشیم و مقدار آن را کم یا زیاد کنیم. در این
        سناریو چربی یکی <code>private state</code> و رفتار هوازی یک <code>public method</code> است.
      </p>
    </Card>
  )
}
