/* @format*/

import { Bold, Card, Code } from '@/app/Components/common'

export default function Polymorphism() {
  return (
    <Card title='Polymorphism'>
      <p>به زبان خیلی ساده: «یک نام (رفتار)، اما چندین شکل اجرا.»</p>
      <p>
        یعنی تو یک دستور واحد می‌دهی (مثلاً: «حرکت کن»)، اما هر شیء بسته به نوع خودش، آن را به روش خودش انجام می‌دهد
        (ماشین راه می‌رود، پرنده پرواز می‌کند، ماهی شنا می‌کند).
      </p>
      <p>
        فلسفه‌اش این است که کد تو به «نوع دقیق» اشیا وابسته نباشد. تو فقط بدانی که آن شیء «می‌تواند» فلان کار را انجام
        دهد، دیگر کاری نداری چطور انجامش می‌دهد. این کار باعث می‌شود کدت بسیار انعطاف‌پذیر شود و برای اضافه کردن
        ویژگی‌های جدید، نیاز نباشد کل کدهای قبلی را شخم بزنی.
      </p>
      <Code light>polymorphism.php</Code>
    </Card>
  )
}
