/** @format */

import { PageTitle } from '@/app/Components/common'
import { LI, UL } from '@/app/Components/List'

export default function Page() {
  return (
    <PageTitle title='پنج مرحله تست نفوذ'>
      <UL>
        <LI title='Reconnaissance' simple={false}>
          این مرحله خیلی مهمه. جمع آوری اطلاعات! یعنی ما باید توو اولین قدم تا میتونیم از قربانی دیتا جمع کنیم. از اسم
          مدیر سایت گرفته تا زبانی که باهاش کد میزنن و ...
          <br />
          چون هرچقدر اطلاعاتمون از قربانی بیشتر باشه بیشتر میتونیم در مورد ضعف هاش مانور بدیم. یعنی از هر دیتایی میتونیم
          به یه آسیب پذیری برسیم. حالا نه حتما ولی هرچقدر دیتا زیاد تر باشه ماهم دستمون باز تره که آسیب پذیری پیدا کنیم.
        </LI>
        <LI title='Scanning' simple={false}>
          توو این مرحله باید سرویس های قربانی رو اسکن کنیم و بفهمیم مثلا سرویس ssh ش بازه؟ پورت فلانش بازه؟ از ورودپرس
          یا فلان زبان استفاده کرده؟
          <br />
          وقتی دیتامون کامل باشه راحت تر می تونیم دنبال آسیب پذیری اون سرویس بگردیم.
        </LI>
        <LI title='Gaining Access' simple={false}>
          بعد از دو مرحله بعدی ما باید سعی کنیم با آسیب پذیری هایی که پیدا کردیم از سرویس های قربانی دسترسی بگیریم. شروع
          نفوذ از این مرحله ست.
        </LI>
        <LI title='Maintaining Access' simple={false}>
          بعد از نفوذ ما باید سعی کنیم دسترسی رو حفظ کنیم. مثلا دسترسی ssh گرفتم ولی باید مراقب باشم که ممکنه هر آن مدیر
          اون سایت سرویس ssh رو ببنده و دسترسی من از بین بره. واسه این کار باید از Back Door ها استفاده کنیم.
        </LI>
        <LI title='Clearing Tracks' simple={false}>
          توو این مرحله هکر باید ردپای خودشو پاک کنه که متخصصین جرم شناسی سایبری نتونی ردی ازش پیدا کنن. اینجا موضوع
          کاملا رقابتیه. یعنی هرکی تخصصش بیشتر باشه موفق تره. چون توو این حوزه راه حل قطعی وجود نداره و هر اشتباهی و سهل
          انگاری ای میتونه باعث لو رفتن هکر بشه.
        </LI>
      </UL>
    </PageTitle>
  )
}
