/** @format */

import { UL, LI } from '../../Components/List'
import { PageTitle } from '../../Components/common'

export default function Page() {
  return (
    <>
      <PageTitle title='سابنتینگ' />

      <UL title='مفاهیم اولیه'>
        <LI title='CIDR ( Classless Inter-Domain Routing )'>
          CIDR روشی برای تخصیص و مسیریابی آدرس‌های IP است که به جای تقسیم‌بندی سنتی بر اساس کلاس‌های A، B و C، از یک
          سیستم انعطاف‌پذیر با استفاده از طول پیشوند (Prefix Length) به شکل /n استفاده می‌کند. این روش امکان ایجاد
          شبکه‌های فرعی با اندازه‌های متغیر و استفاده بهینه‌تر از فضای آدرس‌های IP را فراهم می‌کند.
          <br />
          192.168.1.0/24 یعنی 24 بیت اول آدرس مربوط به بخش شبکه است و بقیه بیت‌ها برای هاست‌ها.
        </LI>
        <LI title='Subnet Mask'>
          Subnet Mask (ماسک زیرشبکه) یک عدد 32 بیتی است که برای جدا کردن بخش شبکه (Network) از بخش میزبان (Host) در یک
          آدرس IP استفاده می‌شود.
          <br />
          Subnet Mask معمول برای شبکه کلاس C:
          <br />
          255.255.255.0
          <br />
          که بصورت باینری بصورت زیر است:
          <br />
          11111111.11111111.11111111.00000000
          <br />
          Subnet Mask در کنار آدرس IP کمک می‌کند تا دستگاه‌ها تشخیص دهند که آیا مقصد در همان شبکه محلی است یا باید از
          طریق روتر ارسال شود.
        </LI>
        <LI title='Wildcard Mask'>
          این مقدار برعکس Subnet Mask می باشد.
          <br />
          مثلا در مثال بالا مقدار WildCard Mask برابر: 0.0.0.255
        </LI>
      </UL>
    </>
  )
}
