/** @format */

import { PageTitle } from '@/app/Components/common'
import { LI, UL } from '@/app/Components/List'

export default function Page() {
  return (
    <PageTitle title='آشنایی با انواع هکر ها'>
      <UL>
        <LI title='هکر کلاه سیاه'>هکر هایی که توی فیلم ها میبینی که دارن به افراد نفوذ میکنن و کارای مخرب میکنن.</LI>
        <LI title='هکر کلاه سفید'>هکر هایی که در قبال دستمزد شرکت هارو در برابر هکر های کلاه سیاه ایمن میکنن.</LI>
        <LI title='هکر کلاه خاکستری'>هکر هایی که گاهی کلاه سفیدن و گاهی کلاه سیاه.</LI>
        <LI title='هکر کلاه قرمز'>
          هکر هایی هستن که با کلاه سیاه ها مبارز میکنن. یعنی مثلا یه هکر کلاه سیاه رو هک میکنه. مثه رابین هود
        </LI>
        <LI title='هکر کلاه آبی'>هکر هایی که علم نفوذ رو یاد میگیرن که انتقام بگیرن :)))</LI>
        <LI title='هکر بچه اسکریپتی'>افرادی که صرفا با اسکریپت هک میکنن. مثلا هکری که قبلا با Sub7 هک می کرد :))</LI>
        <LI title='هکر کلاه سبز'>
          هکر هایی که فقط میخوان یاد بگیرن.اطلاعاتشون کمه و مثه بچه اسکریپتی ها هستن با این تفاوت که قصد آسیب زدن ندارن.
        </LI>
      </UL>
    </PageTitle>
  )
}
