/** @format */

import { Code, PageTitle } from '@/app/Components/common'
import { LI, UL } from '@/app/Components/List'

export default function Page() {
  return (
    <PageTitle title='Usefull'>
      <UL>
        <LI simple={false} title='.gitkeep'>
          توو حالت معمولی نمیتونیم یه فولدر خالی رو توی گیت کامیت کنیم. برای این کار باید توش یه فایل به اسم .gitkeep
          بسازیم.اینجوری گیت اجازه میده فولدر رو کامیت کنی. اگه یه فایلی جز این بزاریم گیت به واسطه ی کامیت کردن اون
          فایل میاد اجازه کامیت فولدر رو میده. ولی با .gitkeep میتونی خود فولدر رو کامیت کنی.
        </LI>
        <LI simple={false} title='source tree'>
          نرم افزار source tree
        </LI>
        <LI simple={false} title='git clean'>
          این دستور فایلی که کامیت نشده رو پاک میکنه. یعنی کلا تا حالا کامیت نشده باشه
          <Code>{`git clean -f filename`}</Code>
        </LI>
        <LI simple={false} title='git stash'>
          -
        </LI>
        <LI simple={false} title='HEAD'>
          یه اشاره گره که بهمون میگه الان سورس کد ما داره به کدوم برنچ یا کامیت اشاره میکنه. وقتی HEAD به یک کامیت اشاره
          میکنه اصطلاحا میگیم detach head که توو این مورد فقط باید نگاه کنیم و نباید کامیت دیگه ای بزنیم.
        </LI>
        <LI simple={false} title='git reflog'>
          این برای زمانیه که مثلا ما ۱۰ تا کامیت داشتیم حالا اومدیم برنچ master رو به چهار تا کامیت قبل ریست کردیم و
          عملا ۶ تا کامیت بعدی رو نداریم. با این دستور اون ۶ تا کامیت بعدی رو هم میتونیم ببینیم. توو خروجی HEAD@{0} نشون
          دهنده آخرین جابجایی HEAD هست حالا میتونیم آی دی اون کامیتی که میخوایم رو برداریم و مستر رو بهش ریست هارد کنیم
          تا برگردیم به حالتی که میخوایم.
        </LI>
        <LI simple={false} title='git rebase'>
          با این دستور میتونیم n کامیت آخر رو تجمیع کنیم.
          <Code>
            {`
git rebase -i HEAD~n
            `}
          </Code>
          بعد این کار n تا کامیت آخری میاد. توی ادیتور باید همه ی کامیت ها بجز اول رو مقدار pick به squash یا s تغییر
          بدیم. اولی رو هم روی همون حالت pick میزاریم بعد دوباره یه ادیتور میاد که مسیج کامیتمون رو بنویسیم. توو این
          حالت کامیتی پاک نمیشه. میتونیم با ریست دوباره ریبس رو برگردونیم به حالت قبل
        </LI>
      </UL>
    </PageTitle>
  )
}
